{"page_number":1,"text":"SMALL ANIMALS ANATOMY – FELINES AND CANINES\n\nFELINE ANATOMY\n\n\nCat is an interesting and unique subject in the animal kingdom. They have extreme strength and agility for\ntheir size, along with heightened senses and the ability to reason. Their eyes are complex organs with keen\neyesight and a broad range of hearing. All felines (along with several other animals such as dogs and cows),\n\nhave a physiological feature in their eyes not found in humans called the tapetum lucidum, a layer of tissue\n                                        found behind the retina. The function of the tapetum lucidum is to\n                                        aid in vision for animals that are active during low light and dark. It\n\n                                        reflects light that enters the retina back into the eye. Because of this,\n                                        cat eyesight suffers in lighted environments, but is superior at night\n\n                                        and in low lit areas. All cats are carnivores and hunt their prey at\n                                        night. The need for superior night vision is a survival mechanism\n                                        developed in certain species, such as cats, to give them a distinct\n\n                                        advantage over prey.\n\nDue to the intricate nature of a cat's body and physiological properties, a delicate balance must be upheld\nwith care. Cats are extremely resilient, but when the immune system or inner organs are affected by\n\ninfection or disease, the outcome is often bleak. The feline anatomy consists of many similarities to that of\nother species, namely the human body. A cat skeleton has a few more bones, but many of these are\nidentical to those of the human skeleton. Uniquely, a cat's collar bone is unattached to the other bone\n\nstructures, and its muscular structure is designed for agility, allowing it to leap, twist and fall with grace.\nFelines and canines have secodont teeth - teeth with sharp cutting edges that produce a shearing action -\n\nthe teeth pattern in adult cats being: upper jaw 3 1 3 1, lower jaw 3 1\n2 1. The temporomandibular joint in felines and canines aids greatly\nthe function of teeth. It has a substantial influence on the occlusion\n\nallowing merely a scissors-like movement of jaws (blocks the sideways\nmovement of jaws which is typical of ruminants).\nIt is a common mistake to refer to the feline claw as retractable. When\n\na cat is relaxed, the claws are sheathed. When the cat voluntarily\nstretches an elastic ligament, the claws are unsheathed and ready for\n\naction. Thus the feline claws are protractile. In the case of cheetahs,\nthe fastest animal on Earth, their claws are always extended to keep its\nrunning speed, which the animal depends on for hunting.\n\n\nSkeletal System\n\nCats are naturally slim and their shoulders are unattached to the animal’s main skeletal frame. This allows\nfor the maximum of flexibility. Their frame is also held together with incredibly strong and elastic ligament.\nFeline anatomy has 3 types of joints:\n\n       Synovial joints – articulatio synovialis – these joints are found in the female anatomy where the cat\n\n        performs the most movement, in the legs. The joint capsule is filled with synovial fluid that\n        lubricates the joint when it is functioning. When cats get older the fluid starts to disappear from the\n        joints and you animal may suffer from arthritis.\n\n       Cartilaginous joints – junctura cartilaginea - the joints in the spine are comprised of thick cartilage\n        disks that are suppler in cats than in other animals. During infancy these joints are susceptible to\n\n        injury because they have not yet matured."}
{"page_number":2,"text":"       Fibrous joints – junctura fibrosa - these joints have no flexibility at all and are found in areas like\n\n        the jaw or mandible.\n\nIntestinal Tract\n\n                                                                     Cats´ teeth play a role in digestion by\n                                                                     tearing sharply at meats and other\n                                                                     substances. As in other species, the\n\n                                                                     salivary glands, oesophagus, stomach,\n                                                                     intestines, liver and kidneys work\n                                                                     together to aid the digestive process. The\n                                                                     gastric acids and enzymes in a cat’s\n                                                                     intestines rapidly break down meat and\n\n                                                                     bones as well as destroy bacteria. This is\n                                                                     the part of feline anatomy that protects\n                                                                     cats from disease and food poisoning\n                                                                     from the carrion they ingest. A cat in the\n                                                                     wild has a digestive system that digests\n\nmeat very efficiently. This accounts for their relatively short intestinal tracts. A domestic, housebound cat\nwill have a tract that is slightly longer because of the controlled diet and lifestyle.\nIllnesses of the gastro-intestinal tract in the feline anatomy are as follow:\n\n       Inflammatory Bowel Disease (IBD)\n\n       Worms\n       Feline Distemper (Feline Panleukopenia)\n       Feline Infectious Peritonitis (very rare)\n       Cancerous tumours\n\n\n\nNervous System\n\nA cat's nervous system is a unique part of the feline anatomy. The nervous system fully develops as the\nkitten ages, barring any trauma or infection that can hinder this process. The central nervous system (CNS)\nis responsible for the brain and spinal cord messages, the peripheral nervous system (PNS) affects muscles\nand movement, and the autonomic nervous system (ANS) controls the involuntary functions of the body.\n\nKittens are born blind with closed eyelids that open by fourteen days of age, exposing the eyeball which is\nnow only mildly sensitive to light. Most kittens will have vision by three to four weeks of age, but it will not\nbe fully developed until after ten weeks of age. All kittens are born deaf as well as blind. Just like the\neyelids, the ear canals remain closed until about two weeks of age when most kittens can hear some\nnoises. However, they are easily startled by sharp noises. Kittens over four weeks of age can hear quite\n\nwell.\n\nReproductive System\n\nThe reproductive system is the part of the feline anatomy that's responsible for mating, copulation,\npregnancy and birth. Female cats, or queens, can produce 2 to 3 litters per year and can give birth to\nmultiple kittens per pregnancy. Cats will not usually go into heat in the winter months, and spaying or\n\nneutering will not only prevent unwanted litters and strays, but can also make for a calmer and more\nrelaxed house pet.\n\nFeline Behaviour\n\nA cat's behaviour is usually evidenced by its stance or meow. The behavioural aspects of the feline\nphysiology lead us to believe that it’s a very intelligent animal. Cats have reasoning abilities, and express\nanger with certain posture, movements and sounds. The temperament of cats varies greatly and can swing"}
{"page_number":3,"text":"from docile and laid back to finicky and aggressive, even pertaining to the same cat. A quick change in\nattitude or evidence of unexpected hiding or aggressive behaviour can indicate a problem. Cats do not\nreact well under stressful conditions and an examination may prove helpful in this case.\n\n\n\n\n\n\nCANINE ANATOMY\n\n\nCanine anatomy, which deals with the structure of the dog, is of basic importance to the veterinarian in the\ntreatment of diseases. For it is only because of their deep knowledge of anatomy that the veterinarian can\ndetermine the exact location of any ailment whenever a disease occurs. Whether we speak of veterinary\n\nmedicine or of human medicine, the fact remains that dog anatomy is the foundation stone upon which the\nentire edifice of modern medicine is built.\n\nDisease is essentially an impairment of the function of a particular organ. Without an understanding of the\n\nanatomy of the organ, scientific treatment is impossible.\n\nRespiratory system\n\nCanines are so called macrosomatic animals in which there is critical importance of the piriform cortex and\nthe other olfactory structures for survival and reproduction. Dog´s regio olfactoria is very large. By the\n\nlength of the skull of individual canine breeds, three types of canine skull can be distinguished:\n       dolichocephalic skull – “longheaded”, relatively long\n        skull (typically with the breadth less than 80% or 75%\n\n        of the length), typical canines e. g. Collie, Dachshund,\n        Greyhound, Great Dane, Siberian Husky\n       mesocephalic skull - of intermediate length and width,\n\n        typical representatives are Labrador Retriever, Beagle,\n        Dalmatian, Rottweiler, Yorkshire Terrier\n       brachycephalic skull - relatively broad and short\n        (typically with the breadth at least 80% of the length),\n\n        with representatives such as Boxer, Pug, Maltese,\n        Chow Chow, Bulldog.\n\nCanine concha nasalis media (the middle thin, spongy, bony plate with curved margins, projecting from the\nlateral wall of the nasal cavity) is very long. Its main functions are purification, humidification and warming\n\nof the air inhaled from the external environment. The system of paranasal cavities is small due to the fact\nthat it consists only of sinus frontalis and recessus maxillaris.\n\nDigestive System\n\n\nThe dog's digestive system begins with its strong jaws and its powerful teeth. Just as felines, canines have\nsecodont teeth with strong incisors, canines, premolars and molars. Their teeth pattern is as follows: upper\njaw 3 1 4 2, and lower jaw 3 1 4 3. Their salivary glands do not produce α-Amylase, an enzyme which\nbreaks down starch as seen in humans, pigs or rabbits. After chewing the food, this is guided to the back\n\npart of the mouth and from there to the throat and the oesophagus. The walls of the canine oesophagus\ndiffer from human. Throughout the course of the whole oesophagus there is striated muscle tissue which\nfacilitates vomiting. The walls are thick but elastic, which allows the dog to ingest very big servings of\nmeals. The stomach wall is covered with glandular mucosa that produces acids and enzymes which\ncontribute to the digestion of food. The shape and size of canine stomach accommodates to great extent to\n\nthe amount of ingested food. In large breeds, there is susceptibility to GDV – gastric dilatation and volvulus,"}
{"page_number":4,"text":"                                                    or the twisting of the stomach. It can be partly prevented\n                                                    by minimizing overfeeding, large water intake in a short\n                                                    period of time or before or after exercise. From the\n\n                                                    stomach the predigested food continues through the\n                                                    pylorus on the way to the duodenum (first part of the\n                                                    small intestine). Here, the peristaltic movements (small\n                                                    intestine wall muscle contractions) are in charge of pulling\n\n                                                    the food to the next part of the intestine. Once it is mixed\n                                                    up with the enzymes that come from the liver and the\n                                                    pancreas, its nutrients can be assimilated by the blood\n                                                    flow. The water contained in food is partially absorbed\n                                                    when going through the large intestine, where a huge\n\n                                                    quantity of bacteria is found. These bacteria contribute to\n                                                    the decomposition of the disposal material. Finally, the\nremains are expelled by the body.\n\n\nExcretory system\n\nThe excretory system is in charge of eliminating toxic substances and metabolic residues from the body,\n\nbesides regulating the quantity of water present in the body. The residues present in blood are filtered by\nkidneys. Subsequently, wastes pass through ureters into the bladder to be stored until disposal in the form\nof urine which is passed out of the body through the urethra in the penis in males or vulva in females.\n\nReproductive system\n\nThe reproductive system guarantees the perpetuation of the species. In the male dog, the testicles are in\n\ncharge of producing the sperm which are transported into the female via penis. The penis is musculo-\ncavernous in design and it is stiffened by os penis. In the female dog, the ovaries are in charge of producing\nthe ova that after being mature enough go through the Fallopian tube heading to the uterus. The uterus of\nthe female dog has a very characteristic shape of Y since it is formed by two horns that meet at the womb.\nDuring pregnancy, the foetuses mature lined up on the uterine body, resembling the distribution of the\n\npeas in their pod.\n\nCardiovascular System\n\nThe cardiovascular system ensures the distribution of food\nand essential substances (especially oxygen and nutrients)\n\nthroughout the body via blood and the lymphatic system. The\nspeed at which the blood flows varies according to the dog's\n\nactivity level. Approximately 20% of the blood pumped from\nthe heart goes to the brain permanently. In periods of intense\nactivity, the amount of blood pumped is increased to raise the\n\noxygen proportions. The blood flow of different parts of the\nbody is controlled by nerves and hormones. The heart has four\n\nchambers — a right and left atrium and a right and left\nventricle. Between the right atrium and the right ventricle the\nostium atrioventriculare dextrum is enclosed by the tricuspid\n\nvalve (valve tricuspidalis). Its cuspis angularis is often indistinct\nand it is for this reason that the valve is called bicuspid valve. The chambers on the right side receive blood\n\nfrom the body and send it out to the lungs, to be enriched with oxygen. Blood returns to the heart from the\nlungs on the left side, and the strong left ventricle then pumps the oxygen-rich blood out to the body."}
{"page_number":5,"text":"Nervous System\n\nThe nervous system controls many mechanisms in the body in order to adapt them to the animal\nnecessities and the surrounding circumstances. The dog's central nervous system is formed by the brain\n\nand the spinal cord that is extended until the base of the tail. The nerve receptors of the skin, the muscles\nand the articulations collect the information related to the environment; for example, if it is hot or cold and\nalso the information related to the dog itself such as its position, for example and constantly send it to the\nbrain and the spinal cord for this information to be processed.\n\nThe dog's cerebral functions have not been completely studied in detail yet, even though it is known that it\n\nhas learning centres that process all the information obtained by senses, specially the senses of smell and\nsight. The dogs, as well as man, have emotional centres that provoke chemical reactions as an answer to\nthe stimulus, which, at the same time, lead to certain types of conduct.\n\nHormones\n\nThe endocrine system contributes to the regulation of the corporal functions through certain glands and\n\ntissues able to produce hormones. The pituitary glands control the dog's overall hormonal system. The\nhormones are responsible for the presence of stress, sexual activity and sugar levels of the blood, three\nfactors that have a clear influence on the dog's behaviour.\n\n\n\nLinks:\n\n\nhttp://www.doghealthproblems.org/doghealthproblems63.php\n\nhttp://www.meowmeister.com/felineanatomyandphysiology.aspx\n\nhttp://www.vetinfo.com/studying-feline-anatomy-physiology.html\n\n\nhttp://www.vetmed.wsu.edu/ClientED/anatomy/\n\nhttp://www.mypetsdentist.com/site/view/114195_TMJproblems.pml\n\nhttp://www.pawsonline.info/claws.htm\n\nhttp://www.associatedcontent.com/article/2357034/the_form_and_function_of_a_cats_eyesight_pg2.html?cat=53\n\n\nhttp://www.sfds.net/Academics/Student_Projects/2001-2002/8th_Grade_Cow_Eye_Dissection/tapetum1_w.html\n\nhttp://www.felineconstipation.org/gut101condensed.html\n\nhttp://www.veterinerara.com/tag/frontal-sinus/\n\n\n\n\nMany thanks to Dr. Paral and Dr. Pyszko for their help with completing this topic."}
